[{"subject":"SANDOZ PLANS WEEDKILLER JOINT VENTURE IN USSR","publishingOrg":"NSA","publicationDate":1584797655103,"body":"Sandoz AG said it planned a joint ventureto produce herbicides in the Soviet Union.    The company said it had signed a letter of intent with theSoviet Ministry of Fertiliser Production to form the firstforeign joint venture the ministry had undertaken since theSoviet Union allowed Western firms to enter into joint venturestwo months ago.    The ministry and Sandoz will each have a 50 pct stake, buta company spokeswoman was unable to give details of the size ofinvestment or planned output. Reuter","pocFullName":"Chris Mertz","pocAddress":"5071 Schiller Plains","pocEmail":"Jacklyn_Brakus@hotmail.com","pocPhone":"700-893-2012 x2024"},{"subject":"TAIWAN REJECTS TEXTILE MAKERS EXCHANGE RATE PLEA","publishingOrg":"CIA","publicationDate":1586308672152,"body":"Central bank governor Chang Chi-chengrejected a request by textile makers to halt the rise of theTaiwan dollar against the U.S. Dollar to stop them losingorders to South Korea, Hong Kong and Singapore, a spokesman forthe Taiwan Textile Federation said.    He quoted Chang as telling representatives of 19 textileassociations last Saturday the government could not fix theTaiwan dollar exchange rate at 35 to one U.S. Dollar due toU.S. Pressure for an appreciation of the local currency.    The Federation asked the government on February 19 to holdthe exchange rate at that level.    The federation said in its request that many local textileexporters were operating without profit and would go out ofbusiness if the rate continued to fall. Reuter","pocFullName":"Will Halvorson","pocAddress":"81953 Tromp Branch","pocEmail":"Beryl31@gmail.com","pocPhone":"1-676-519-7143"},{"subject":"NATIONAL FSI INC <NFSI> 4TH QTR LOSS","publishingOrg":"NSA","publicationDate":1583532540658,"body":"Shr loss six cts vs profit 19 cts    Net loss 166,000 vs profit 580,000    Revs 3,772,000 vs 5,545,000    Year    Shr loss 13 cts vs profit 52 cts    Net loss 391,000 vs profit 1,425,000    Revs 15.4 mln vs 16.6 mln    NOTE: 1985 year figures pro forma for purchase accountingadjustments resulting from March 1985 reeacquisition of companyby its original shareholders before August 1985 initial publicoffering.  Reuter","pocFullName":"Elenora Abbott","pocAddress":"146 Zemlak Spurs","pocEmail":"Eloisa_Schuster39@gmail.com","pocPhone":"(981) 934-0070"},{"subject":"OCCIDENTAL <OXY> OFFICIAL RESIGNS","publishingOrg":"MARINES","publicationDate":1587388933523,"body":"MidCon Corp, a subsidiary ofOccidental Petroleum Corp <OXY>, said William C. Terpstra hasresigned as president and chief operating officer and hisreponsibilities will be assumed by MidCon chairman O.C. Davis.    No reason was given. Reuter","pocFullName":"Kayli Heller","pocAddress":"0891 Chance Turnpike","pocEmail":"Gracie48@yahoo.com","pocPhone":"1-901-678-6300 x971"}]